{"Dim ID": "D1", "Dimension Name": "Reasoning Sophistication", "Hardened Definition": "The internal cognitive processes an individual agent employs to analyze information, generate solutions, and refine outputs—independent of whether other agents or humans are involved. Captures within-agent cognition only.", "Value Creation Logic": "Higher reasoning sophistication enables better decision quality, more innovative solutions, and successful handling of complex tasks", "Source Basis": "Sun et al. (2025); Liu et al. (2025); Li et al. (2025); Hatalis et al. (2023)"}
{"Dim ID": "D2", "Dimension Name": "Tool Integration Depth", "Hardened Definition": "The extent to which an agent can discover, select, invoke, and orchestrate external tools and services to accomplish tasks", "Value Creation Logic": "Deeper tool integration expands agent action space, enables automation of technical tasks, and connects to enterprise systems for productivity and revenue value", "Source Basis": "Mohammadi et al. (2025); Liu et al. (2025); Zhang et al. (2026)"}
{"Dim ID": "D3", "Dimension Name": "Memory Persistence", "Hardened Definition": "The temporal scope and sophistication of information retention mechanisms that enable agents to maintain context and learn from experience", "Value Creation Logic": "Greater memory persistence enables consistency over long interactions, personalization, and cumulative learning—critical for productivity and decision quality in extended engagements", "Source Basis": "Hatalis et al. (2023); Mohammadi et al. (2025)"}
{"Dim ID": "D4", "Dimension Name": "Coordination Paradigm", "Hardened Definition": "The structural arrangement by which multiple agents (or agent-human combinations) organize to divide labor, share information, and integrate outputs—independent of any individual agent's reasoning capability. Captures between-agent architecture only.", "Value Creation Logic": "Multi-agent coordination enables division of labor, collective intelligence, and handling of tasks beyond single-agent capability—driving productivity and innovation at scale", "Source Basis": "Liu et al. (2025); Maldonado et al. (2024); Sun et al. (2025)"}
{"Dim ID": "D5", "Dimension Name": "Autonomy Level", "Hardened Definition": "The locus of decision authority determining what goals the agent pursues and what actions it takes—specifically, the degree to which humans vs. the agent controls goal-setting and action-selection. Captures human-agent authority distribution only.", "Value Creation Logic": "Higher autonomy enables continuous operation and reduced human overhead, while managed autonomy balances productivity gains with appropriate risk mitigation", "Source Basis": "Morris et al. (2024); Acharya et al. (2025); Liu et al. (2025)"}
{"Dim ID": "D6", "Dimension Name": "Adaptation Mechanism", "Hardened Definition": "The means by which an agent improves its performance or adjusts to new situations over time", "Value Creation Logic": "Effective adaptation reduces ongoing costs (no retraining), enables continuous improvement, and supports innovation through knowledge transfer", "Source Basis": "Li et al. (2025); Sun et al. (2025); Wu et al. (2024)"}
{"Dim ID": "D7", "Dimension Name": "Human Collaboration Mode", "Hardened Definition": "The nature and depth of interaction patterns between the agent and human users or team members", "Value Creation Logic": "Appropriate collaboration modes build trust, ensure value alignment, and enable effective human-AI teaming—critical mediators of actual value realization", "Source Basis": "Wachowiak et al. (2024); Iftikhar et al. (2024); He et al. (2025)"}
{"Dim ID": "D8", "Dimension Name": "Compliance & Alignment Posture", "Hardened Definition": "The degree to which an agent operates within organizational policies, regulatory requirements, ethical standards, and intended value alignment", "Value Creation Logic": "Robust compliance enables enterprise deployment by ensuring regulatory adherence, policy conformance, and sustained alignment with organizational values", "Source Basis": "OpenAI Preparedness Framework; Mohammadi et al. (2025); Liu et al. (2025); Acharya et al. (2025)"}
{"Dim ID": "D9", "Dimension Name": "Safety Architecture", "Hardened Definition": "The comprehensiveness of mechanisms protecting against harmful outputs, adversarial attacks, system failures, and unintended consequences", "Value Creation Logic": "Comprehensive safety architecture is prerequisite for scaled deployment, protecting against liability, operational disruption, and reputational harm", "Source Basis": "OpenAI Preparedness Framework; Mohammadi et al. (2025); Piccialli et al. (2025)"}